<!DOCTYPE html>
<html lang="es">
	<head>
		
		<!-- Metadatos -->
		
		<meta charset="UTF-8">
		<meta name="viewport" content="width=device-width, initial-scale=1.0" />
		<meta name="theme-color" content="#0c212e">
		<title>Memoria ROM</title>
		<base href="../../">
		
		<!-- Google Founts -->
		
		<link rel="preconnect" href="https://fonts.googleapis.com">
		<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
		<link href="https://fonts.googleapis.com/css2?family=Poppins:wght@400;500;600&family=Roboto:wght@400;700&display=swap" rel="stylesheet">
		
		<!-- Estilos Generales -->
		
		<link rel="stylesheet" href="css/estilos.css" />
	</head>
	<body>
		
		<!-- Header -->
		<div class="wrapper">
			<header class="header">
				<span class="logo">Computador</span>
				<div>
					<button class="button"><a href="index.html">Home</a></button>
					<button class="button"><a href="D-Storage.html">Volver</a></button>
				</div>	
			</header>
			
			<!-- Wrapper content -->
			
			<section class="wrapper-content">
				<span class="title">¿Qué es una Memoria ROM?</span>
				<p>es un medio de almacenamiento utilizado en ordenadores y dispositivos electrónicos, que permite solo la lectura de la información y no su escritura</p>  
			</section>		
		</div>
		<main class="main">
			<h1>Memoria ROM</h1>
			<section>
				<article>
					
					<figure>
						<img alt="Memoria ROM" src="src/img/image10.jpg" title="Memoria ROM" />
						<figcaption>Memoria ROM</figcaption>
					</figure>
					
					<h2>Qu&eacute; es la memoria ROM</h2>
    
					<p>Memoria de solo lectura, conocida tambi&eacute;n como&nbsp; <a class="active-link" target="_blank" href="https://es.wikipedia.org/wiki/Memoria_de_solo_lectura#cite_note-1&sa=D&source=editors&ust=1664561046537081&usg=AOvVaw0WIOoj2lzo8kR2O_zXogEg">ROM</a> &nbsp;(acr&oacute;nimo en ingl&eacute;s de&nbsp; read-only memory), es un medio de almacenamiento utilizado en ordenadores y dispositivos electr&oacute;nicos, que permite solo la lectura de la informaci&oacute;n y no su escritura, &#8203; independientemente de la presencia o no de una fuente de energ&iacute;a.</p>
					
					<p>Los datos almacenados en la ROM no se pueden modificar, o al menos no de manera r&aacute;pida o f&aacute;cil. Se utiliza principalmente para contener el&nbsp;<a class="active-link" href="https://es.wikipedia.org/wiki/Firmware" target="_blank">firmware</a>&#8203; (programa que est&aacute; estrechamente ligado a hardware espec&iacute;fico, y es poco probable que requiera actualizaciones frecuentes) u otro contenido vital para el funcionamiento del dispositivo, como los programas que ponen en marcha el ordenador y realizan los diagn&oacute;sticos.</p>
					
    
					<p>En su sentido m&aacute;s estricto, se refiere solo a m&aacute;scara ROM -en ingl&eacute;s, MROM- (el m&aacute;s antiguo tipo de estado s&oacute;lido ROM), que se fabrica con los datos almacenados de forma permanente, y por lo tanto, su contenido no puede ser modificado de ninguna forma. Sin embargo, las ROM m&aacute;s modernas, como&nbsp;<a class="active-link" href="https://es.wikipedia.org/wiki/EPROM" target="_blank">EPROM</a>&nbsp;y&nbsp;<a class="active-link" href="https://es.wikipedia.org/wiki/Flash_EEPROM" target="_blank">Flash EEPROM</a>efectivamente se pueden borrar y volver a programar varias veces, aun siendo descritos como &quot;memoria de solo lectura&quot; (ROM). La raz&oacute;n de que se las contin&uacute;e llamando as&iacute; es que el proceso de reprogramaci&oacute;n en general es poco frecuente, relativamente lento y, a menudo, no se permite la escritura en lugares aleatorios de la memoria. A pesar de la simplicidad de la ROM, los dispositivos reprogramables son m&aacute;s flexibles y econ&oacute;micos, por lo cual las antiguas m&aacute;scaras ROM no se suelen encontrar en hardware producido a partir de 2007.</p>
					

				</article>
				<article>
					<h2>&iquest;Cu&aacute;ndo se invent&oacute; la memoria ROM?</h2>
    
					<p>Inventada en 1956, permit&iacute;a a los usuarios modificarla solo una vez, alterando f&iacute;sicamente su estructura con la aplicaci&oacute;n de pulsos de alto voltaje.</p>
    
					<h2>Inventor</h2>
      
					<figure>
						<img alt="Chou Wen-chung" src="src/img/image2.jpg" title="Chou Wen-chung" />
						<figcaption>&nbsp;Wen Tsing Chow</figcaption>
					</figure>
				</article>
			</section>
		</main>
	</body>
</html>		